{
    "capability": "IT Service Management",
    "research_date": "2025-08-01",
    "market_analysis": {
        "primary_vendors": ["comarch", "servicenow", "salesforce"],
        "missing_capabilities": [
            "AI‑driven predictive analytics for IT service optimization",
            "Cost and capacity management within the service portfolio",
            "Chatbot‑driven self‑service for ITSM requests",
            "Integration with sustainability metrics (e.g., green IT impacts)"
        ]
    },
    "attributes": [
        {
            "attribute": "Catalog Structuring Flexibility",
            "tm_capability": "TMF633 - Service Catalog Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch’s Service Catalog centralizes service specifications and supports CFS‑to‑RFS decomposition rules, allowing services to be organized by business unit and functional domain【72444882975881†L83-L149】.\n• The catalog supports parent/child hierarchies, tagging and dependency rules, enabling grouping by lifecycle stage and NFV service chaining【72444882975881†L83-L149】.\n• Lacks strong tagging for internal vs customer‑facing services; hierarchy management may require technical expertise.\n• Score is advanced because catalog structure is flexible and integrates with product catalog, though some tagging and role‑based visibility limitations remain.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Comarch allows hierarchical service models, dependency rules and integration with product catalog; limited internal/customer distinction lowers the score slightly."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow’s service catalog allows publishing and requesting of services; items can include workflows and approval rules (general knowledge).\n• Catalog items support custom forms and categories, but available documentation pages were inaccessible – event and incident docs confirm generic capabilities only【494944655751002†screenshot】.\n• No accessible evidence of parent/child hierarchies or tagging for internal vs customer services.\n• Assigned a standard score because ServiceNow is known to support configurable catalogs but lack of accessible documentation limits confidence.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-servicenow-platform/page/product/service-catalog-management/concept/service-catalog.html",
                "score_decision": "A moderate score reflects widely used catalog capabilities, but evidence is limited."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce focuses on CRM and case management; no dedicated service catalog was found in accessible docs.\n• Incident object supports classification fields such as category and impact, showing basic structuring【182216071221815†screenshot】.\n• No hierarchical catalog or tagging features for IT services.\n• Score is basic because Salesforce lacks a dedicated IT service catalog and grouping flexibility.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Incident object provides only basic categorization; absence of catalog management lowers the score."
            }
        },
        {
            "attribute": "Lifecycle State Management",
            "tm_capability": "TMF633 - Service Catalog Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Services in Comarch’s catalog can have statuses such as Draft, Published and Active with version control; lifecycle changes trigger workflows within OSS/BSS【72444882975881†L83-L149】.\n• Integration with change and release management allows automated transitions between states with approvals【606480370306803†L83-L178】.\n• Version history is maintained within the catalog; older versions remain available for audit.\n• Score is advanced because lifecycle states are configurable and integrated with workflows, though not fully autonomous.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Comarch provides configurable lifecycle states and workflows; missing AI‑driven automation keeps the score at 4."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• Standard ServiceNow catalog items support lifecycle states (Draft, Published) and use workflows for approvals (general knowledge).\n• Incident management documentation shows states like detected, resolved and closed with fields such as StartDateTime and EndDateTime【888700060617203†screenshot】, hinting at lifecycle tracking.\n• No accessible evidence of configurable state transitions or version history in catalogs.\n• Score is standard because ServiceNow likely supports state transitions but evidence is limited.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Lifecycle states are present in incidents and catalogs, but limited accessible evidence reduces confidence."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• The Salesforce Incident object has date fields like DetectedDateTime and EndDateTime and a boolean IsMajorIncident to track states【888700060617203†screenshot】【382296236114349†screenshot】.\n• There is no evidence of configurable lifecycle states for services; only basic start/end tracking for incidents.\n• Lacks version history or approval workflows for lifecycle transitions.\n• Score is basic due to minimal state management in the incident object.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Only simple date fields for incident state; no lifecycle management for service definitions results in a low score."
            }
        },
        {
            "attribute": "Configuration Flexibility ",
            "tm_capability": "TMF633 - Service Catalog Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Administrators can define service specification attributes, decomposition rules and alarms without vendor intervention【72444882975881†L83-L149】.\n• Catalog supports adding new fields, service options and quality rules; integration with product catalog ensures consistency【72444882975881†L83-L149】.\n• Some configuration may require technical knowledge of SID model; UI customization options are not fully self‑service.\n• Score is advanced because of high configurability with some limitations.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Comarch offers flexible configuration of service attributes and rules; minor vendor assistance needed reduces the score slightly."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow platform generally allows adding custom fields and forms using the table schema and Flow Designer.\n• The major incident process page shows ability to create problems and assign tasks; customizing communication plans is possible【104358565176061†screenshot】.\n• However, evidence for self‑service configuration of catalog fields was not accessible.\n• Score is standard due to known configurability, albeit with limited documentation.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "ServiceNow provides customizable forms and workflows, but lack of accessible catalog configuration evidence limits scoring."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Incident object allows customizing picklists and fields such as Impact and Category【182216071221815†screenshot】【888700060617203†screenshot】.\n• Adding or modifying service definitions requires custom development on the Salesforce platform (e.g., Service Cloud or custom objects).\n• Lacks out‑of‑box configuration of IT service catalog attributes.\n• Score is basic because customizing fields is possible but not specifically for ITSM services.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Salesforce allows field customization but not dedicated service catalog; limited flexibility results in low score."
            }
        },
        {
            "attribute": "Integration with Product Catalog",
            "tm_capability": "TMF620 - Product Catalog Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch’s Service Catalog is pre‑integrated with the Product Catalog, allowing business products to map to underlying services and resources【72444882975881†L83-L149】.\n• Supports CFS–RFS decomposition and SID model alignment, enabling seamless linkage between commercial products and technical services【72444882975881†L83-L149】.\n• Integration enables automatic service fulfillment and assurance across OSS/BSS components.\n• Score is enterprise‑grade due to deep integration and telecom‑specific decomposition rules.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Pre‑integration with product catalog and CFS–RFS alignment justify the highest score."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow offers integrations through IntegrationHub and Product Catalog Management (general knowledge).\n• Evidence for linking IT service catalog to commercial product catalog is not available; service catalog is often independent of product offers.\n• Integration with external offers may require custom development or plugins.\n• Score is standard because integration is possible but not native or well‑documented in accessible sources.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-servicenow-platform/page/product/service-catalog-management/concept/service-catalog.html",
                "score_decision": "Without specific documentation, only standard integration is assumed."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce primarily offers product catalogs in Commerce and CPQ; there is no native link between incident management and a product catalog.\n• Incidents may be associated with ServiceContract or Asset, but integration with product catalog requires custom development.\n• No evidence of telecom‑specific service/product linkage.\n• Score is basic because of minimal integration.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Incident objects lack built‑in product catalog linkage, resulting in a low score."
            }
        },
        {
            "attribute": "Business Case Evaluation Support",
            "tm_capability": "TMF669 - Service Qualification API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch’s catalog supports capturing KPIs and service quality indicators, which can be used in value assessments【72444882975881†L83-L149】.\n• Business case evaluation features like ROI estimation or demand scoring are not explicitly mentioned.\n• Users can propose new services through forms, but financial prioritization is not highlighted.\n• Score is standard because some metrics exist but structured business case evaluation is limited.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Lack of dedicated business case evaluation tools limits scoring."
            },
            "servicenow": {
                "score": "2 - Basic",
                "observation": "• ServiceNow Strategic Portfolio Management (formerly ITBM) provides demand management and ROI tools, but documentation was not accessible.\n• No evidence from accessible docs for capturing value drivers or financial scoring.\n• Basic project portfolio features may exist but outside ITSM scope.\n• Score is basic due to missing accessible evidence.",
                "evidence": "https://www.servicenow.com/products/strategic-portfolio-management.html",
                "score_decision": "Without documentation, only a low score can be justified."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce Service Cloud offers case and incident management but does not include business case evaluation tools.\n• No evidence of ROI or demand scoring frameworks for IT services.\n• Business case evaluation would require custom analytics or AppExchange solutions.\n• Score is not supported due to absence of native features.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Incident management lacks business case evaluation; therefore score is 1."
            }
        },
        {
            "attribute": "Service Dependency Mapping",
            "tm_capability": "TMF640 - Service Inventory Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Catalog supports service decomposition and dependency rules; service dependency models can represent relationships between customer‑facing services and underlying network resources【72444882975881†L83-L149】.\n• Service Monitoring module visualizes dependencies as service trees with required, optional, failover and weighted links and supports root‑cause analysis【725612218266588†L80-L109】.\n• Integration with CMDB and network inventory provides end‑to‑end view from customer products to resources【835714802116191†L80-L153】.\n• Score is enterprise‑grade due to rich visualization and integration across modules.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Advanced dependency models and service tree visualization justify top score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Event Management process links alerts to Configuration Items (CIs) for root‑cause analysis【494944655751002†screenshot】.\n• The platform includes a CMDB that maintains relationships between CIs, enabling service maps and impact analysis (general knowledge).\n• No specific evidence from accessible docs about telecom service dependency mapping.\n• Score is advanced because CMDB and event management allow dependency mapping, albeit without telecom‑specific decomposition.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "CMDB and event‑alert linkage provide advanced dependency mapping; absence of telecom specialization prevents enterprise rating."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce Incident object can relate to assets or service contracts but not map complex service dependencies.\n• There is no service tree visualization or CMDB; relationships between CIs would require custom objects.\n• Basic relationships (e.g., parent incident) are possible but limited.\n• Score is basic due to minimal dependency mapping capabilities.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of native CMDB or service dependency mapping results in low score."
            }
        },
        {
            "attribute": "User Visibility / Portal",
            "tm_capability": "TMF632 - Service Order Management API (for requests)",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch Digital Self‑Service portal allows customers to browse offers, compare products, manage accounts, perform operations (top‑ups, contract renewals) and handle complex tasks via omnichannel REST API【335600095396063†L80-L165】.\n• Service owners can publish or update catalog entries; portal supports personalized marketing and contextual support.\n• Visibility can be limited by user role and location; integration with case management and chat ensures self‑service.\n• Score is advanced because of flexible self‑service portal though not fully multi‑tenant for internal departments.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Comprehensive self‑service portal with role‑based visibility supports advanced rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Service Portal provides a configurable self‑service interface where users can browse and request services (general knowledge).\n• Major incident management documentation emphasizes communication plans and keeping stakeholders informed【104358565176061†screenshot】.\n• Visibility can be limited using roles and user criteria, though no accessible evidence is available.\n• Score is advanced as ServiceNow is known for robust service portals despite lacking documented proof here.",
                "evidence": "https://www.servicenow.com/products/service-portal.html",
                "score_decision": "Well‑known portal capability and communications plans justify high score despite missing citation."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce Experience Cloud provides portals and communities where users can log incidents and request support.\n• Incident object includes fields for Impact and Category, which can be exposed to users【182216071221815†screenshot】.\n• However, there is no dedicated IT service catalog portal; customizing requires development.\n• Score is standard because portals exist but not tailored for ITSM services.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Portals exist but require customization for ITSM, resulting in a mid‑range score."
            }
        },
        {
            "attribute": "Versioning & Audit Trails",
            "tm_capability": "TMF633 - Service Catalog Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch’s catalog maintains service version history, enabling rollback and comparison; changes are logged for audit【72444882975881†L83-L149】.\n• Service inventory and monitoring modules generate audit trails of configuration changes and asset lifecycle events【835714802116191†L80-L153】.\n• Limited evidence of user‑readable change logs or diff visualization.\n• Score is advanced because versioning is supported but lacks modern diff tools.",
                "evidence": "https://www.comarch.com/telecommunications/service-inventory/",
                "score_decision": "Presence of versioning and audit logging yields high score; missing diff UI prevents top rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow platform includes sys_history tables capturing changes to records and versioning; event management ties alerts to CIs for root‑cause analysis【494944655751002†screenshot】.\n• Change management documentation describes creating problems for root cause analysis and reviewing incidents for process improvement【104358565176061†screenshot】.\n• Versioning of catalog items is possible via update sets, though not evidenced here.\n• Score is advanced because audit trails and version history are strong features even though documentation is partial.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Platform‑wide audit logs and process reviews justify high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce provides field history tracking and audit trails for objects like Incident; changes can be monitored via History tables.\n• Incident object tracks times and statuses (DetectedDateTime, EndDateTime) and fields like Impact which can be changed and audited【888700060617203†screenshot】.\n• No built‑in versioning for service definitions as there is no service catalog.\n• Score is standard because basic audit trails exist but no full version control for service configurations.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Field history tracking exists; absence of service versioning yields a moderate score."
            }
        },
        {
            "attribute": "SLA Definition Flexibility",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Monitoring and Quality Management enable definition of quality indicators and thresholds; service models include optional, required and weighted components with KPIs and KQIs【725612218266588†L80-L109】【128780989245804†L80-L145】.\n• Supports customizable SLA parameters such as availability, response time, and penalty logic; integrates with alarm propagation and predictive analytics【725612218266588†L116-L137】.\n• SLAs can be defined per service type and time of day; integration with event management triggers alerts.\n• Score is enterprise‑grade due to flexible SLA definitions and advanced analytics.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Flexible SLA definitions and integration with monitoring justify top score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Event Management allows alert thresholds and accumulations based on event types【924221753076†screenshot】.\n• SLA definitions in ServiceNow allow configuring conditions like response and resolution times through SLA definitions (general knowledge).\n• No accessible doc showing time‑of‑day variations or multi‑tiered conditions.\n• Score is advanced because SLA definitions are well‑supported but evidence is partial.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Alert thresholds and known SLA modules provide strong support; missing citations reduce score slightly."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce Service Cloud allows entitlement management and milestones, but these were not observed in the Incident object.\n• There is no evidence of defining SLAs by time of day or conditions.\n• Basic response time tracking may be achieved through custom fields.\n• Score is basic due to absence of flexible SLA definitions.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Lack of SLA functionality in accessible docs results in a low score."
            }
        },
        {
            "attribute": "SLA Monitoring & Alerts",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Monitoring correlates events from fault, quality and performance management to monitor SLA compliance in real time【725612218266588†L80-L109】.\n• The system triggers alarms when thresholds are exceeded and automatically creates trouble tickets【725612218266588†L116-L137】.\n• Alarm propagation rules, root‑cause analysis and predictive maintenance reduce SLA breaches.\n• Score is enterprise‑grade due to real‑time monitoring, alerts and proactive analytics.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Real‑time SLA monitoring and automated alerts justify the highest score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• Event Management process flow includes alert generation from events and can accumulate events until thresholds are met, then generate a single alert【924221753076†screenshot】.\n• Alerts are associated with configuration items and can trigger remediation actions【494944655751002†screenshot】.\n• ServiceNow’s SLA engine (general knowledge) monitors response and resolution metrics and triggers notifications.\n• Score is advanced due to effective alert generation, though predictive analytics are limited in accessible docs.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Alert process flow and threshold accumulation provide strong monitoring capabilities."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce incidents have date/time fields but there is no built‑in SLA monitoring; entitlements and milestones can track response times but not observed in this object.\n• Users must implement custom automation (e.g., Process Builder) to trigger alerts on SLA breaches.\n• No evidence of real‑time monitoring or automated escalations.\n• Score is basic due to limited SLA monitoring in accessible docs.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of native SLA monitoring results in low score."
            }
        },
        {
            "attribute": "Reporting & Analytics",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch Service Quality Management transforms network data into customer‑centric reports and dashboards showing KQI/KPI trends and interdependencies【128780989245804†L80-L145】.\n• Predictive maintenance and AI algorithms provide analytics for anomaly detection and SLA performance.\n• Reporting covers service quality across 5G and IoT services【128780989245804†L80-L145】.\n• Score is advanced because analytics are comprehensive, though cross‑departmental reporting could be improved.",
                "evidence": "https://www.comarch.com/telecommunications/service-quality-management/",
                "score_decision": "Comprehensive quality analytics and predictive maintenance justify high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow provides dashboards for event management and major incident KPIs, with alerts displayed for tracking and remediation【924221753076†screenshot】.\n• Platform analytics (Performance Analytics) offers reporting across incidents and SLAs (general knowledge).\n• There is limited accessible evidence of telecom‑specific analytics.\n• Score is advanced due to strong reporting capabilities though lacking telecom‑specific data.\n",                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Event dashboards and known analytics capabilities warrant high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce provides standard reports and dashboards for custom objects; incident records can be reported by category, impact and dates.\n• Fields like Impact (High, Medium, Low) support filtering and grouping【888700060617203†screenshot】.\n• No specialized analytics for IT service quality; customizing requires additional modules.\n• Score is standard because generic reporting exists but not advanced for ITSM.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Generic reporting is available but lacks SLA analytics, resulting in mid score."
            }
        },
        {
            "attribute": "Penalty/Reward Support",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Service quality management can calculate KPIs and KQIs which operators may use to derive penalties or rewards; however explicit penalty/reward calculations are not described【128780989245804†L80-L145】.\n• Integration with billing systems could allow penalty invoicing but this is not documented.\n• No configurable penalty formulas or reward models in accessible docs.\n• Score is standard because metrics exist but no dedicated penalty module.",
                "evidence": "https://www.comarch.com/telecommunications/service-quality-management/",
                "score_decision": "Presence of KPIs but absence of explicit penalty management results in moderate score."
            },
            "servicenow": {
                "score": "2 - Basic",
                "observation": "• ServiceNow’s SLA module tracks performance but there is no evidence of penalty/reward computation in accessible docs.\n• Penalties may be handled manually or via integrations with contract management.\n• Score is basic because native support is limited.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Lack of evidence for penalty computations results in low score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not provide penalty or reward computation for SLAs within the incident object.\n• Such calculations would require custom code or external systems.\n• Score is not supported.\n• ",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No native penalty or reward support found."
            }
        },
        {
            "attribute": "Multi-tier SLA Support",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch supports multiple levels of quality metrics, including service‑level, network‑level and resource‑level KPIs【725612218266588†L80-L109】.\n• Operators can define global, regional and customer‑specific KPIs; optional and weighted components allow hierarchical SLA definitions【725612218266588†L80-L109】.\n• There is no explicit mention of nested SLA inheritance across organizations.\n• Score is advanced because multi‑tiered metrics exist, though hierarchical SLA inheritance could be better defined.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Weighted components and different scopes justify high score."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow can define multiple SLA definitions and attach them to tasks based on conditions; events can accumulate before triggering a single alert【924221753076†screenshot】.\n• Evidence for hierarchical SLA layering (global, region, customer) is not available in accessible docs.\n• Score is standard due to generic SLA support but lack of multi‑tier evidence.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Basic SLA layering is assumed; absence of documentation reduces score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce incidents do not support multi‑tier SLA structures; any SLA layering must be custom built.\n• No evidence of hierarchical SLA support.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of multi‑tier SLA features results in lowest score."
            }
        },
        {
            "attribute": "Design Workflow Management",
            "tm_capability": "TMF664 - Service Design & Build API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch’s catalog and OSS Service Desk enable creating and approving service specifications and changes; checklists and correlation engines assist in design review【606480370306803†L83-L178】.\n• There is no dedicated collaborative design workflow tool; design tasks are managed within change management or service catalog.\n• Score is standard because collaboration exists through integrated modules but not as a separate design workflow engine.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Integrated checklist and approval flows provide basic design coordination but not advanced features."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow platform uses Flow Designer and Workflow Editor for drag‑and‑drop automation (general knowledge).\n• Major incident management process includes phases such as identification, communication and review which require coordination across stakeholders【104358565176061†screenshot】.\n• No specific evidence for service design coordination but workflows can be repurposed.\n• Score is advanced due to strong workflow capabilities albeit limited design templates.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Workflow tools and incident coordination support high score."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce Flow and Process Builder provide basic automation but are geared towards sales and service processes.\n• There is no evidence of collaborative service design workflows.\n• Score is basic due to general workflow tools not optimized for IT service design.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "General workflow tools only support simple processes; lacking design coordination reduces score."
            }
        },
        {
            "attribute": "Design Version Control",
            "tm_capability": "TMF664 - Service Design & Build API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Service versions are maintained within Comarch catalog; design templates can be updated and previous versions stored【72444882975881†L83-L149】.\n• However, there is no evidence of diff comparison or branch/merge controls.\n• Score is standard because versioning exists but lacks advanced version control features.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Basic version storage without branching yields standard rating."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow uses update sets and application repository for versioning; changes can be tracked through sys_history (general knowledge).\n• No accessible evidence of version control for design templates.\n• Score is standard due to platform support but no dedicated design versioning.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Version control exists via update sets but not specialized for design."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce provides source control integration through SFDX and Git for metadata, but not specific to service design.\n• Incident object changes can be tracked through field history but not versioned templates.\n• Score is basic due to limited design version control.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Generic metadata versioning but no service design control yields low score."
            }
        },
        {
            "attribute": "Reference Architecture Library",
            "tm_capability": "TMF664 - Service Design & Build API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch provides a library of service templates and blueprints aligned with TM Forum SID and NFV models【72444882975881†L83-L149】.\n• However, this is not a publicly accessible architecture library; details are limited.\n• Score is standard because templates exist but library scope is unclear.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Presence of templates but limited documentation leads to moderate score."
            },
            "servicenow": {
                "score": "2 - Basic",
                "observation": "• There is no evidence of a reference architecture library for service designs; ServiceNow provides baseline workflows but not telecom architectures.\n• Users often build their own design templates.\n• Score is basic due to absence of documented library.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Lack of reference architecture library results in low score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• No reference architecture library for IT service designs exists within Salesforce.\n• Users rely on AppExchange or custom development.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of such library leads to lowest score."
            }
        },
        {
            "attribute": "Integration with Change/Release Mgmt",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch OSS Service Desk integrates change, incident and problem management, providing workflow automation and checklists【606480370306803†L83-L178】.\n• Approved service designs automatically pass to change and release processes; planned work management supports scheduling and risk analysis【606480370306803†L83-L178】.\n• Integration with Service Catalog ensures design changes trigger appropriate release tasks.\n• Score is advanced because integration exists across modules, though not fully continuous delivery.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Strong integration with change and release management justifies high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow’s Change Management module is deeply integrated with release and deployment via change workflows (general knowledge).\n• Major incident process emphasises creating a problem record and review, which links back to change management【104358565176061†screenshot】.\n• Evidence from Stanford guide shows standardized methods and procedures to understand and test changes, plus risk assessment and approvals【473642921084728†L188-L233】.\n• Score is advanced due to integrated modules, albeit limited accessible docs.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Strong integration across change and incident management leads to high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce Incident object is isolated; there is no native change or release management.\n• Integrating with DevOps Center or external tools is possible but not built in.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Lack of change/release management leads to lowest score."
            }
        },
        {
            "attribute": "Design Governance",
            "tm_capability": "TMF664 - Service Design & Build API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch enforces SID compliance and NFV service chaining rules, ensuring designs adhere to telecom standards【72444882975881†L83-L149】.\n• OSS Service Desk checklists and approvals ensure architecture standards during service design【606480370306803†L83-L178】.\n• No mention of automated rule enforcement or policy engines.\n• Score is advanced due to standards compliance and checklists.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Built‑in design rules and checklists support advanced governance."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow uses governance via policies and compliance frameworks; however, accessible docs do not detail service design governance.\n• Change management processes require risk assessment and approval, which help enforce standards【473642921084728†L188-L233】.\n• Score is standard due to generic governance and missing design‑specific policies.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Generic governance and approvals provide moderate support."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• No evidence of design governance for IT services within Salesforce.\n• Governance must be implemented manually or through DevOps best practices.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of governance features yields lowest score."
            }
        },
        {
            "attribute": "Change Type Handling",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch OSS Service Desk supports incident, problem and change management with flexible workflows and checklists【606480370306803†L83-L178】.\n• Standard, emergency and normal changes can be processed with appropriate approvals and scheduling.\n• Score is advanced because multi‑type change handling is supported, albeit less documented than ServiceNow.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Support for various change types and workflows warrants high score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• The Stanford ServiceNow Change Management guide lists standard, emergency and normal change types and describes risk assessment, approvals and testing processes【473642921084728†L188-L233】.\n• ServiceNow supports templates for standard changes and dedicated workflows for emergency changes.\n• The platform automates routing based on risk, cost and business unit.\n• Score is enterprise‑grade due to comprehensive change type handling and automation.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Detailed change types and automated workflows justify the highest score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not provide change management functionality.\n• Change requests and types would require custom objects or third‑party apps.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No native change management features result in lowest score."
            }
        },
        {
            "attribute": "Change Impact Analysis",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch OSS Service Desk includes root‑cause and impact analysis using a correlation engine and checklists; integration with Service Monitoring visualizes impacted services【606480370306803†L83-L178】.\n• Impact analysis uses dependency mapping and network events correlation to estimate service interruption.\n• Score is advanced because impact analysis is built‑in though not AI‑based.\n• ",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Built‑in impact analysis and correlation justify high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Change Management uses risk and impact assessment questionnaires (as per Stanford guide) and can link to CI relationships in CMDB【473642921084728†L188-L233】.\n• Event management links alerts to CIs for root‑cause analysis, aiding impact analysis【494944655751002†screenshot】.\n• Score is advanced because risk calculators and CMDB integration provide strong impact assessment.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Risk assessment and CI linkage deliver advanced impact analysis."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• There is no impact analysis feature for changes in Salesforce; incident object lacks links to configuration items.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of change management results in lowest score."
            }
        },
        {
            "attribute": "Change Calendar",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch OSS Service Desk includes planned work management with scheduling and integration with Field Service Management【606480370306803†L83-L178】.\n• However, there is no evidence of a visual change calendar for organization‑wide planning.\n• Score is standard due to scheduling support but not full calendar view.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Schedule management but no dedicated calendar yields mid score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Change Management features a change calendar for scheduling and reviewing changes across teams (commonly known).\n• The Stanford guide references scheduling and testing steps for changes【473642921084728†L188-L233】.\n• Evidence of visual calendar is not accessible but widely recognized.\n• Score is advanced due to integrated change calendar.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Known change calendar support justifies high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not provide a change calendar; scheduling changes would require custom apps.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No change management features means lowest score."
            }
        },
        {
            "attribute": "Change Approval Workflows",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch uses checklist‑based approvals in OSS Service Desk; changes require authorization based on risk and business impact【606480370306803†L83-L178】.\n• Approval workflows can be multi‑level, but there is limited evidence of dynamic routing.\n• Score is advanced due to flexible approvals though not fully rule‑based.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Multiple approval levels and checklists justify high score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow Change Management supports multi‑level approvals based on risk, cost and business unit with configurable rules (as per Stanford guide)【473642921084728†L188-L233】.\n• Standard and emergency changes follow different approval paths; risk assessment determines approvers.\n• Score is enterprise‑grade due to robust approval workflows and dynamic routing.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Comprehensive approval workflows merit highest rating."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce lacks built‑in change approval workflows for IT services.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No change management capability results in lowest score."
            }
        },
        {
            "attribute": "CAB Management",
            "tm_capability": "TMF655 - Change Management API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch provides change and incident management but there is no explicit Change Advisory Board (CAB) management module; approvals are handled via checklists【606480370306803†L83-L178】.\n• CAB meetings may be supported through integration with external tools.\n• Score is standard because CAB support is implicit rather than explicit.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Absence of dedicated CAB module results in mid score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Change Management includes Change Advisory Board Workbench enabling agenda planning, approval tracking and meeting documentation (commonly known).\n• The Stanford guide discusses CAB responsibilities and escalation paths, though not the tool itself【473642921084728†L188-L233】.\n• Score is advanced due to CAB support even though accessible docs are limited.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Existing CAB workbench and processes justify high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not support CAB management.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No change management leads to lowest score."
            }
        },
        {
            "attribute": "Release Bundling",
            "tm_capability": "TMF656 - Release Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch allows grouping of changes into deployable units with rollback plans via its release management functions integrated with service desk【606480370306803†L83-L178】.\n• Bundles can include configuration changes, network updates and service definitions; integrated with planned work.\n• Score is advanced because bundling exists but details on rollback automation are limited.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Release bundling support with rollback yields high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Release and Deployment Management groups changes into releases, integrates with Change Management and supports rollback via tasks (commonly known).\n• The Stanford guide emphasises testing and certification before deployment【473642921084728†L188-L233】.\n• Score is advanced due to robust bundling though not evidenced here.\n",                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Known release bundling capabilities support high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce lacks release management for IT services; deployments are managed through metadata API but not service releases.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No release management features lead to low score."
            }
        },
        {
            "attribute": "Deployment Automation",
            "tm_capability": "TMF656 - Release Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch supports integration with CI/CD pipelines and orchestration tools for automatic deployment of network services and IT changes【606480370306803†L83-L178】.\n• Pre‑integration with NFV orchestration allows automated service chaining and activation【72444882975881†L83-L149】.\n• Score is advanced because deployment automation is available but not fully microservices‑based.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Integration with CI/CD and NFV orchestration yields high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow DevOps integration offers automated deployments and pipelines; CI/CD tools can trigger change requests and approvals (general knowledge).\n• Event management ensures deployment events create alerts; no accessible docs show details.\n• Score is advanced due to known automation capabilities though evidence is limited.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "DevOps integration provides strong automation support."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce provides metadata deployment tools (Change Sets, SFDX) but not designed for IT service deployments.\n• There is no direct integration with IT service change management or orchestration.\n• Score is basic due to limited automation for ITSM.\n",                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Limited metadata deployment yields low score."
            }
        },
        {
            "attribute": "Release Window Governance",
            "tm_capability": "TMF656 - Release Management API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch planned work management includes time slots and approvals for deployments【606480370306803†L83-L178】.\n• There is no evidence of guardrails or blackout periods enforcement.\n• Score is standard as some governance exists but not comprehensive.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Scheduled deployments with approvals provide moderate governance."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow release calendars and policies allow organizations to control deployment windows (commonly known).\n• Risk assessment and approval workflows enforce guardrails【473642921084728†L188-L233】.\n• Score is advanced because governance is robust though not evidenced here.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Change policies and calendars enable strong governance."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce has no notion of release windows for IT services.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No release governance features present."
            }
        },
        {
            "attribute": "Release Documentation",
            "tm_capability": "TMF656 - Release Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch release management allows attaching release notes, backout plans and test evidence within change tickets【606480370306803†L83-L178】.\n• Information management features share updates with stakeholders and field teams【606480370306803†L83-L178】.\n• Score is advanced because documentation is structured but not necessarily standardized across all modules.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Structured release documentation and attachments support high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow release and change records include fields for implementation plans, backout plans, test results and related artifacts (general knowledge).\n• The Stanford guide emphasises reviewing each change and conducting post‑implementation reviews【473642921084728†L188-L233】.\n• Score is advanced due to comprehensive documentation options.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Change templates with fields for plans and evidence justify high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not provide release documentation features for IT services; any documentation must be attached manually.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No release management equals no documentation support."
            }
        },
        {
            "attribute": "Environment Readiness Check",
            "tm_capability": "TMF656 - Release Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Pre‑deployment checks in Comarch release management ensure test pass and configuration readiness【606480370306803†L83-L178】.\n• Integration with Service Monitoring verifies network and service status before deployment.\n• Score is advanced because readiness checks exist but may not be fully automated.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Pre‑deployment checks integrated with monitoring support high score."
            },
            "servicenow": {
                "score": "3 - Standard",
                "observation": "• ServiceNow change management encourages testing and certification before deployment as per Stanford guide【473642921084728†L188-L233】.\n• There is no accessible evidence of automated readiness checks.\n• Score is standard because readiness is manual rather than enforced.",
                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "Testing requirements exist but automation lacks evidence."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce provides no environment readiness checks for IT service deployments.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No release management results in lowest score."
            }
        },
        {
            "attribute": "CMDB Integration",
            "tm_capability": "TMF639 - Resource Inventory Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Inventory maintains relationships between assets, services and infrastructure; integration with service catalog and network inventory provides top‑down/bottom‑up views【835714802116191†L80-L153】.\n• CMDB tracks full lifecycle of configuration items and calculates KPIs for service monitoring.\n• Supports bridging gap between business services and technical resources to automate fulfillment.\n• Score is enterprise‑grade due to comprehensive, integrated CMDB.",
                "evidence": "https://www.comarch.com/telecommunications/service-inventory/",
                "score_decision": "Rich CMDB integration and service/resource mapping justify top score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow CMDB is central to the platform, storing relationships between CIs, applications and services (common knowledge).\n• Event management links alerts to CIs for root‑cause analysis【494944655751002†screenshot】.\n• CMDB integrates with change, incident and configuration management.\n• Score is enterprise‑grade due to robust and widely used CMDB.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Comprehensive CMDB integration merits highest rating."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce does not provide a native CMDB; assets can be tracked via objects but not in a hierarchical CMDB structure.\n• Incident records can reference a Contact or Account, but configuration relationships are limited.\n• Score is basic due to minimal asset tracking.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Lack of CMDB but ability to relate objects results in low score."
            }
        },
        {
            "attribute": "Asset Lifecycle Tracking",
            "tm_capability": "TMF639 - Resource Inventory Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Service Inventory tracks assets from procurement to retirement, including ownership, location and changes【835714802116191†L80-L153】.\n• Integration with network and service catalog ensures updates are reflected across systems.\n• Score is advanced because lifecycle tracking is comprehensive though may lack predictive asset analytics.",
                "evidence": "https://www.comarch.com/telecommunications/service-inventory/",
                "score_decision": "Comprehensive asset lifecycle tracking justifies high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow IT Asset Management tracks hardware and software lifecycles (common knowledge).\n• CMDB and asset tables maintain ownership, location and assignment.\n• No accessible docs but widely recognized; Score is advanced.",
                "evidence": "https://docs.servicenow.com/bundle/washingtondc-it-asset-management/page/product/asset-management/concept/c_AssetManagement.html",
                "score_decision": "Known asset management capabilities support high rating."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce can store assets associated with accounts, but lifecycle tracking (procurement to retirement) is limited.\n• Custom objects or third‑party solutions are required for full tracking.\n• Score is basic.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Limited asset functionality results in low score."
            }
        },
        {
            "attribute": "Discovery & Inventory Automation",
            "tm_capability": "TMF640 - Service Inventory Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch Service Inventory and Monitoring can automatically discover and update records of hardware and software assets across networks【835714802116191†L80-L153】.\n• Supports network discovery, device identification and top‑down/bottom‑up synchronization.\n• Score is advanced but not microservices‑based.\n",                "evidence": "https://www.comarch.com/telecommunications/service-inventory/",
                "score_decision": "Automated discovery and inventory management justify high score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow Discovery automatically identifies infrastructure and applications across data centers and cloud (common knowledge).\n• Data is fed into the CMDB, maintaining relationships and dependencies.\n• Though documentation wasn’t accessible, the capability is widely recognized.\n• Score is enterprise‑grade.",
                "evidence": "https://www.servicenow.com/products/itsm/itsm-discovery.html",
                "score_decision": "Automated discovery integrated with CMDB merits highest rating."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not provide discovery of infrastructure or network assets.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of discovery tools results in lowest score."
            }
        },
        {
            "attribute": "Audit & Compliance Reporting",
            "tm_capability": "TMF639 - Resource Inventory Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Service Inventory provides audit trails and compliance reports for configuration changes and asset lifecycle events【835714802116191†L80-L153】.\n• Integration with quality and monitoring modules ensures compliance with SLA and regulatory requirements.\n• Score is advanced because reporting exists but may not include built‑in compliance frameworks.\n",                "evidence": "https://www.comarch.com/telecommunications/service-inventory/",
                "score_decision": "Audit trails and reporting support high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow provides audit logs, compliance dashboards and GRC modules for policy compliance (common knowledge).\n• sys_audit tables track field changes; Performance Analytics offers compliance reporting.\n• Score is advanced even though evidence is limited.",
                "evidence": "https://www.servicenow.com/products/itsm/itsm-audit.html",
                "score_decision": "Robust audit and compliance features justify high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce tracks field history and login histories; compliance reporting exists but primarily for CRM.\n• Incident object changes can be audited【888700060617203†screenshot】.\n• There is no ITSM compliance reporting.\n• Score is standard due to basic audit features but lacking compliance frameworks.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Basic audit logs but no compliance frameworks lead to mid score."
            }
        },
        {
            "attribute": "CI Relationship Visualization",
            "tm_capability": "TMF640 - Service Inventory Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Service Inventory provides graphical and tabular views of how CIs relate to services and customers, supporting top‑down and bottom‑up visualization【835714802116191†L80-L153】.\n• Service Monitoring displays service trees with different relation types such as required, optional and failover【725612218266588†L80-L109】.\n• Score is enterprise‑grade due to rich visualization and impact navigation.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Advanced service tree and dependency visualization justify highest score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow CMDB uses dependency views to graphically display relationships between CIs and services; event management ties alerts to CIs for root‑cause analysis【494944655751002†screenshot】.\n• Map view supports impact and service path analysis.\n• Score is enterprise‑grade due to comprehensive visualization.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Dependency views and event‑CI linkage support highest rating."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce has no built‑in visualization of CI relationships; only simple relationships like related incidents are available.\n• Graphical dependency mapping would require custom solutions.\n• Score is basic due to lack of visualization.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Minimal relationship features result in low score."
            }
        },
        {
            "attribute": "Event Correlation & Filtering",
            "tm_capability": "TMF688 - Event Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Service Monitoring correlates events from fault, quality and performance systems using pattern rules, threshold accumulation and root‑cause logic【725612218266588†L80-L109】.\n• Supports suppression, deduplication and custom alarm propagation to avoid noise【725612218266588†L116-L137】.\n• Machine learning algorithms provide predictive analytics for anomaly detection【128780989245804†L80-L145】.\n• Score is enterprise‑grade because of comprehensive correlation and AI support.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Advanced correlation and predictive analytics justify highest rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• Event Management process flow matches events against rules, applies transforms, accumulates thresholds, maps fields and generates alerts【924221753076†screenshot】【494944655751002†screenshot】.\n• Rules can ignore, transform or threshold events to reduce noise.\n• While correlation is rule‑based rather than AI‑driven, it effectively filters events.\n• Score is advanced due to strong rule‑based correlation but lacking machine learning.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Rule‑driven correlation and filtering provide high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not have event management or correlation for IT infrastructure.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No event management capabilities found."
            }
        },
        {
            "attribute": "Real-time Monitoring Integration",
            "tm_capability": "TMF688 - Event Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Monitoring integrates with fault, performance and quality management systems across multi‑vendor networks, receiving events via SNMP, APM and other interfaces【725612218266588†L80-L109】.\n• Real‑time data feeds support 5G and IoT services and predictive maintenance【128780989245804†L80-L145】.\n• Score is enterprise‑grade due to broad integration and real‑time analytics.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Comprehensive real‑time integration and analytics justify top rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Event Management receives external events via email, scripts, SNMP traps and web service API; MID Server polls external event tracking tools【924221753076†screenshot】.\n• Alerts appear on dashboards in real time for remediation.\n• Score is advanced because integration is strong but not specialized for telecom.\n",                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Multiple input channels and real‑time dashboards provide high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not integrate with real‑time IT monitoring; any integration requires custom connectors.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No monitoring integration yields lowest score."
            }
        },
        {
            "attribute": "Automated Response Actions",
            "tm_capability": "TMF688 - Event Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Service Monitoring can automatically create trouble tickets and trigger remediation workflows based on event conditions【725612218266588†L116-L137】.\n• Integration with OSS Service Desk and Field Service Management executes corrective actions.\n• Machine learning helps predict issues but full automated remediation may require manual steps.\n• Score is advanced due to automation and integration.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Automatic ticket creation and workflows provide high rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• Event Management process can generate alerts and create incidents or change requests via alert actions (general knowledge).\n• The process flow describes alert generation and binding to CIs; however automated remediation actions are not detailed【494944655751002†screenshot】.\n• Score is advanced due to automation potential though not fully documented.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Ability to create incidents and tasks automatically yields high score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce incidents do not support automated response actions triggered by IT events.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No event management means no automated actions."
            }
        },
        {
            "attribute": "Event Suppression & Deduplication",
            "tm_capability": "TMF688 - Event Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch Service Monitoring supports alarm suppression, deduplication and custom alarm propagation rules to reduce noise【725612218266588†L116-L137】.\n• Event correlation engine distinguishes root‑cause events and suppresses duplicates.\n• Score is enterprise‑grade due to sophisticated suppression mechanisms.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Advanced alarm propagation and deduplication justify top rating."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Event Management rule engine can ignore events and apply transforms; threshold accumulation ensures multiple events generate a single alert【924221753076†screenshot】.\n• Field mapping and alert generation associate events under a single alert【494944655751002†screenshot】.\n• Score is advanced because deduplication is rule‑based; lacks AI suppression.\n",                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Rule‑based suppression yields high but not perfect score."
            },
            "salesforce": {
                "score": "1 - Not Supported",
                "observation": "• Salesforce does not have event suppression or deduplication features for IT events.\n• Score is not supported.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "No event management leads to lowest score."
            }
        },
        {
            "attribute": "Severity & Priority Mapping",
            "tm_capability": "TMF688 - Event Management API",
            "comarch": {
                "score": "5 - Enterprise-Grade",
                "observation": "• Comarch allows customizable severity and priority levels; service models include weighted components and optional/required attributes【725612218266588†L80-L109】.\n• Alarm propagation rules propagate severity to dependent services and adjust accordingly【725612218266588†L116-L137】.\n• Score is enterprise‑grade because severity mapping is granular and integrated with service hierarchy.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Sophisticated severity propagation justifies top score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• Event process flow includes matching events and generating alerts; severity and priority can be mapped via rules and transforms【924221753076†screenshot】.\n• Incident management uses impact and urgency to calculate priority (general knowledge).\n• Score is advanced due to configurable mappings though not AI‑driven.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Rule‑based priority mapping yields high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Incident object includes fields Impact (High/Medium/Low) and Category【888700060617203†screenshot】.\n• Additional custom fields can be added for priority mapping.\n• Lacks automated calculation based on business impact.\n• Score is standard because basic fields exist but mapping is manual.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Presence of impact field but absence of automation results in mid score."
            }
        },
        {
            "attribute": "Omni-Channel Incident Logging",
            "tm_capability": "TMF621 - Trouble Ticket API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch Digital Self‑Service portal allows logging incidents from web, mobile and chat channels【335600095396063†L80-L165】.\n• OSS Service Desk can receive tickets automatically from service monitoring and from field service systems【606480370306803†L83-L178】.\n• Telephony or email integration is not explicitly mentioned.\n• Score is advanced because multiple channels are supported but not all.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Self‑service and automation channels provide high score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow Incident Management accepts incidents via portal, email, phone, API and chat; event management can automatically create incidents (general knowledge).\n• The event process flow shows alerts leading to incident creation【494944655751002†screenshot】.\n• Score is enterprise‑grade due to comprehensive omni‑channel support.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Multiple channels including automated event creation justify highest rating."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce Service Cloud supports case creation via portal, email, phone and chat, and the Incident object can be created through API.\n• However, not all ITSM channels (e.g., SNMP events) are supported.\n• Score is standard because of multi‑channel case logging but lacking IT operations channels.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "General omni‑channel support provides mid‑range score."
            }
        },
        {
            "attribute": "Categorization & Prioritization",
            "tm_capability": "TMF621 - Trouble Ticket API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• OSS Service Desk classifies incidents based on service impact and uses correlation engine to prioritize critical issues【606480370306803†L83-L178】.\n• Service Monitoring passes severity and priority along with tickets【725612218266588†L116-L137】.\n• Score is advanced due to automated categorization and prioritization.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Automated classification and priority mapping yield high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• Incident management uses impact and urgency to calculate priority; event process maps events to alerts with rules【924221753076†screenshot】.\n• Classification can be automated via assignment rules and categorization fields (general knowledge).\n• Score is advanced as these capabilities are well supported.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Automated categorization and priority calculation justify high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Incident object includes Category and Impact fields allowing manual prioritization【182216071221815†screenshot】【888700060617203†screenshot】.\n• Automated priority calculation requires custom workflows.\n• Score is standard because basic categorization exists but lacks automation.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Manual fields but no automation result in mid score."
            }
        },
        {
            "attribute": "Knowledge-Based Resolution",
            "tm_capability": "TMF621 - Trouble Ticket API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch digital self‑service and OSS Service Desk provide contextual help and case management; integration with knowledge base is implied but not detailed【335600095396063†L80-L165】.\n• Machine learning assists in root‑cause analysis and anomaly detection【725612218266588†L116-L137】.\n• Lack of explicit knowledge article suggestions reduces the score.\n• Score is standard because knowledge is present but not clearly integrated.\n",                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Contextual support implies knowledge base but documentation is limited."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow Knowledge Management provides contextual articles during incident resolution and portal search (known).\n• Major incident management process emphasises creating problem records for postmortem and knowledge capture【104358565176061†screenshot】.\n• Score is enterprise‑grade due to strong knowledge integration across ITSM modules.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Embedded knowledge base and contextual suggestions justify highest rating."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce Service Cloud includes Knowledge articles that can be linked to cases and incidents; fields like Description support storing resolution notes【182216071221815†screenshot】.\n• However, there is no dedicated ITSM knowledge suggestion engine.\n• Score is standard due to general knowledge base integration but not specialized.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Knowledge articles exist but limited ITSM integration yields mid score."
            }
        },
        {
            "attribute": "SLA-Driven Escalations",
            "tm_capability": "TMF657 - Service Quality Management API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch Service Monitoring triggers alarms and trouble tickets when thresholds are near or violated; escalation rules can notify stakeholders【725612218266588†L116-L137】.\n• Integration with Service Desk ensures escalations follow defined processes.\n• Score is advanced because escalation logic is present but may not be fully customizable.",
                "evidence": "https://www.comarch.com/telecommunications/service-monitoring/",
                "score_decision": "Automated escalations based on SLA violation deliver high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow SLA module triggers escalations and notifications when response/resolution thresholds approach breach (known).\n• Event process can accumulate events and generate a single alert to avoid noise【924221753076†screenshot】.\n• Score is advanced because of strong escalation features though not shown in docs.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Well‑known SLA and escalation capabilities justify high score."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce cases can trigger escalations based on assignment rules, but SLA‑driven escalations for incidents are not built in.\n• Custom workflows are required to send alerts on SLA breaches.\n• Score is basic.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Absence of SLA module results in low score."
            }
        },
        {
            "attribute": "Major Incident Workflow",
            "tm_capability": "TMF621 - Trouble Ticket API",
            "comarch": {
                "score": "3 - Standard",
                "observation": "• Comarch Service Desk handles high‑priority incidents with root‑cause analysis and planned works【606480370306803†L83-L178】.\n• There is no specific description of a separate major incident workflow; escalations follow standard processes.\n• Score is standard because major incidents are handled but not distinguished.",
                "evidence": "https://www.comarch.com/telecommunications/oss-service-desk/",
                "score_decision": "Absence of distinct major incident process reduces score."
            },
            "servicenow": {
                "score": "5 - Enterprise-Grade",
                "observation": "• ServiceNow documentation provides a dedicated Major Incident Management process with identification, communication and post‑incident review phases【469580226151287†screenshot】【104358565176061†screenshot】.\n• Requirements include minimizing impact, designating major incident managers, informing stakeholders and creating problems for root‑cause analysis【104358565176061†screenshot】.\n• Score is enterprise‑grade because process is comprehensive and integrated with other modules.\n",                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Detailed major incident workflow and guidelines warrant top rating."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Incident object has a boolean IsMajorIncident field indicating business‑critical incidents【382296236114349†screenshot】.\n• There is no full major incident process or workbench.\n• Score is basic due to minimal support.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Simple flag without workflow yields low score."
            }
        },
        {
            "attribute": "Request Catalog Management",
            "tm_capability": "TMF641 - Service Ordering API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Digital Self‑Service platform provides a structured catalog of services and products with comparison and purchase capabilities【335600095396063†L80-L165】.\n• Service catalog items are tied to order management and can be fulfilled automatically.\n• Score is advanced because of integrated catalog and ordering, though not fully marketplace‑driven.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Comprehensive request catalog with ordering integration yields high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Service Catalog allows users to browse and select from structured items and request services (known).\n• Catalog items include workflows and approvals; categories and variables are configurable.\n• Score is advanced despite lacking direct evidence due to widely known features.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-servicenow-platform/page/product/service-catalog-management/concept/service-catalog.html",
                "score_decision": "Strong service catalog management justifies high score."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce does not provide a structured ITSM request catalog; however, Service Cloud includes self‑service portals for cases.\n• Catalog management would require building custom objects or using AppExchange apps.\n• Score is basic because there is no native request catalog.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Lack of service catalog features results in low score."
            }
        },
        {
            "attribute": "Request Automation & Orchestration",
            "tm_capability": "TMF641 - Service Ordering API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch digital self‑service and service catalog link to fulfillment workflows and automation; orders trigger orchestration across OSS systems【72444882975881†L83-L149】.\n• Integration with network orchestration and NFV ensures service activation.\n• Score is advanced because automation is strong but not AI‑driven.",
                "evidence": "https://www.comarch.com/telecommunications/service-catalog/",
                "score_decision": "Automated fulfillment integrated with orchestration yields high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow uses Flow Designer and Service Catalog workflows to automate request fulfillment; integration with IntegrationHub orchestrates external systems (known).\n• Event management can trigger workflows based on alerts.\n• Score is advanced even though evidence is limited.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-event-management/page/product/event-management/concept/alert-processor-flow.html",
                "score_decision": "Workflow and IntegrationHub capabilities justify high score."
            },
            "salesforce": {
                "score": "2 - Basic",
                "observation": "• Salesforce can automate case routing and approvals via Flow, but orchestrating IT service provisioning requires custom development.\n• There is no built‑in request orchestration for infrastructure.\n• Score is basic due to limited automation for IT requests.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "General automation tools but no IT orchestration results in low score."
            }
        },
        {
            "attribute": "Entitlement & Approval Rules",
            "tm_capability": "TMF641 - Service Ordering API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch self‑service portal enforces user and role‑based eligibility for offers; supports hierarchical approvals for certain requests【335600095396063†L80-L165】.\n• Integration with service desk ensures approvals for changes and high‑impact requests【606480370306803†L83-L178】.\n• Score is advanced because entitlement and approval rules are configurable though not fully dynamic.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Role‑based visibility and approvals justify high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow Service Catalog uses user criteria and roles to control access to catalog items; approvals can be configured by hierarchy and business rules (known).\n• SLA and change approvals ensure governance【473642921084728†L188-L233】.\n• Score is advanced because entitlements and approvals are strong though not evidenced here.\n",                "evidence": "https://uit.stanford.edu/sites/g/files/sbiybj10786/f/cm_servicenowchangemanagementguide.pdf",
                "score_decision": "User criteria and flexible approvals warrant high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce uses Profiles, Permission Sets and Sharing Rules to control object and record access; Flow can enforce approval processes.\n• There is no built‑in ITSM entitlement module.\n• Score is standard because entitlement control exists but not specialized for IT requests.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Generic permission controls provide moderate support."
            }
        },
        {
            "attribute": "Request Status Tracking",
            "tm_capability": "TMF641 - Service Ordering API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Digital self‑service portal displays real‑time status of orders, account changes and service requests【335600095396063†L80-L165】.\n• Integration with service desk updates customers on progress and SLAs.\n• Score is advanced because of real‑time tracking though not cross‑channel analytics.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Real‑time request tracking justifies high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow portal and mobile app allow users to track the status of requests, incidents and changes (known).\n• Major incident process emphasises keeping stakeholders informed of interruptions and progress【104358565176061†screenshot】.\n• Score is advanced due to strong status tracking capabilities.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-it-service-management/page/product/incident-management/concept/major-incident-management-process.html",
                "score_decision": "Status tracking across portal and notifications supports high score."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce Experience Cloud allows customers to check case status; Incident object fields indicate detection and closure times【888700060617203†screenshot】.\n• There is no specific ITSM request tracking dashboard.\n• Score is standard.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Basic case status tracking leads to mid rating."
            }
        },
        {
            "attribute": "Dynamic Forms & Input Validation",
            "tm_capability": "TMF641 - Service Ordering API",
            "comarch": {
                "score": "4 - Advanced",
                "observation": "• Comarch digital self‑service forms adapt based on service type; API‑driven forms collect necessary information and perform validation before submission【335600095396063†L80-L165】.\n• Integration with service catalog ensures forms reflect service configuration.\n• Score is advanced because forms are dynamic though not AI‑guided.",
                "evidence": "https://www.comarch.com/telecommunications/digital-services/digital-self-service-platform/",
                "score_decision": "Adaptive forms with validation justify high score."
            },
            "servicenow": {
                "score": "4 - Advanced",
                "observation": "• ServiceNow catalog items support dynamic variables and UI policies to show/hide fields based on user input (known).\n• Validation scripts ensure data accuracy; Flow Designer and Client Scripts enforce logic.\n• Score is advanced, albeit not evidenced.",
                "evidence": "https://docs.servicenow.com/bundle/yokohama-servicenow-platform/page/product/service-catalog-management/concept/service-catalog.html",
                "score_decision": "Dynamic variables and validation scripts provide high rating."
            },
            "salesforce": {
                "score": "3 - Standard",
                "observation": "• Salesforce Flow and Lightning Web Components can build dynamic forms; field validation rules ensure data correctness.\n• Incident object forms are static by default; dynamic behaviour requires development.\n• Score is standard because dynamic forms exist but not pre‑built for ITSM.",
                "evidence": "https://developer.salesforce.com/docs/atlas.en-us.object_reference.meta/object_reference/sforce_api_objects_incident.htm",
                "score_decision": "Customizable dynamic forms lead to mid score."
            }
        }
    ]
}
