{
    "capability": "Partner Management",
    "analysis_date": "2025-08-03",
    "capability_status": "new",
    "proposed_framework": {
        "domains": [
            {
                "domain_name": "Partner Strategy & Planning",
                "description": "Functions that define and analyse the organisation’s partner strategy, purchasing needs and sourcing plans.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Strategy definition & observance",
                        "definition": "Develops and maintains partner and purchasing strategies, including make‑or‑buy decisions and collaboration constraints. It also monitors compliance with the defined strategy.",
                        "tm_forum_mapping": "Purchasing Strategy Definition aggregate function – develops purchasing strategy according to partner collaboration constraints【944636172426758†L30-L32】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Needs forecasting",
                        "definition": "Forecasts purchasing and partnership needs by territory and business unit, considering strategic priorities, budget and technical constraints.",
                        "tm_forum_mapping": "Purchasing Needs Forecasts aggregate function – gathers forecasts and defines external purchase volumes by perimeter and country【431379999964934†L30-L33】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Tender & sourcing management",
                        "definition": "Manages request‑for‑information, request‑for‑quotation and request‑for‑proposal processes, defines tenders, evaluates partners and validates winning bids.",
                        "tm_forum_mapping": "Purchasing Tender Management aggregate function – defines tenders, triggers calls for tender and validates accepted partners【16815074275344†L30-L35】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Cost and savings analysis",
                        "definition": "Analyses purchasing implementation and sourcing savings to achieve cost reduction or avoidance by comparing budgets with purchase order payments and identifying process improvements.",
                        "tm_forum_mapping": "Sourcing Savings Management aggregate function – aims to get cost reduction/avoidance by comparing budgets with approved purchase orders and improving processes【740986882014391†L30-L51】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Strategy implementation analysis",
                        "definition": "Evaluates the effectiveness of purchasing and partner strategies by analysing results and adherence to strategic objectives.",
                        "tm_forum_mapping": "Purchasing Implementation Analysis aggregate function – evaluates purchasing implementation according to the defined strategy【115814271351453†L30-L31】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Onboarding & Information Management",
                "description": "Controls the onboarding of new partners and manages their profiles, hierarchies, preferences and risk information.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Partner onboarding",
                        "definition": "Captures and validates all information required to onboard new partners (legal, financial, technical) via automated workflows or self‑service portals.",
                        "tm_forum_mapping": "Business Partner Product Specification & Offering Onboarding collects information from partners to onboard their product specifications and offerings【380262850828339†L33-L35】; vendor solutions such as CSG and Subex highlight zero‑touch onboarding and workflow‑based registration【250300021536997†L124-L148】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Profile & preferences management",
                        "definition": "Creates and maintains partner profiles, including contact details, preferences, and collaboration information. Supports creation, update and deletion of profiles and tracks validity and recency.",
                        "tm_forum_mapping": "Partner Profile Management – manages partner preferences and information details【935297509132519†L27-L31】; Partner Preferences Management allows creation, update, deletion and lifecycle supervision【836822317717215†L29-L33】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Hierarchy & group management",
                        "definition": "Defines partner hierarchies, groups and territories and assigns partners to appropriate groups to reflect multi‑level channel structures.",
                        "tm_forum_mapping": "Partner Hierarchy & Group Management – provides functionality to manage partner hierarchy and groups【851013082392119†L28-L30】; Partner Group and Hierarchy Definition and Assigning define group types and assign partners accordingly【919820688341109†L29-L31】【533369901400846†L29-L31】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Financial risk management",
                        "definition": "Collects financial risk information from third parties, assesses partner creditworthiness and calculates risk scores to support onboarding and engagement decisions.",
                        "tm_forum_mapping": "Partner Financial Risk Management manages information about the partner’s financial status and associated risks【936866992268158†L28-L35】; Business Partner Financial Analysis identifies financial risks and calculates risk scores for each partner【338184556346341†L30-L32】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Compliance & due diligence",
                        "definition": "Performs due‑diligence checks (e.g., KYC, AML, ethics and environmental criteria) and ensures partners comply with regulatory and internal policies.",
                        "tm_forum_mapping": "Business Partner Performance Evaluation considers financial risk analysis, previous performance, and criteria on ethics and the environment during evaluation【667091016437991†L31-L38】.",
                        "importance": "high"
                    }
                ]
            },
            {
                "domain_name": "Partner Product & Offering Onboarding",
                "description": "Manages the onboarding of partner product specifications and offerings, including product certification and quoting processes.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "Product specification onboarding",
                        "definition": "Collects product information from partners and integrates it with the service provider’s product catalogue to enable quoting and ordering.",
                        "tm_forum_mapping": "Business Partner Product Specification and Offering Management manages product specification and offering onboarding and requests for quotation【80916068737197†L35-L37】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Product certification & quality assurance",
                        "definition": "Evaluates and certifies partner products or services for compliance with technical, regulatory and quality standards before they are offered to customers.",
                        "tm_forum_mapping": "Partner Product Certification is a function within the product onboarding process【380262850828339†L50-L58】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Quoting & proposal management",
                        "definition": "Supports requests for information, quotation and proposal processes, enabling partners to provide bids and converting accepted quotes into orders.",
                        "tm_forum_mapping": "Purchasing Tender Management covers RFI, RFQ and RFP processes for tenders【16815074275344†L30-L35】; Comarch’s PRM offers catalogue‑driven quoting and bid conversion into orders【877572897611138†L80-L146】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Interaction & Collaboration",
                "description": "Provides channels and tools for partners to interact with the service provider, including portals, self‑service access, marketing collaboration and communication management.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Portal access & self‑service",
                        "definition": "Offers a single entry point for partners to access functions, information and tools; ensures role‑based security and supports self‑service activities such as onboarding, deal registration, and account management.",
                        "tm_forum_mapping": "Business Partner Portal Access provides a self‑service entry point for partners and ensures role‑based security【118499276135085†L28-L33】; ZINFI notes that a portal centralizes resources such as training materials and marketing assets【745588469347582†L382-L389】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Interaction logging & journalizing",
                        "definition": "Records and stores all interactions with partners across assisted and unassisted channels (self‑service portals, call center, retail store, etc.), enabling 360° visibility of partner engagement.",
                        "tm_forum_mapping": "Partner Interaction Collection & Storage records all interactions from all channels【902136489007946†L28-L29】; Partner Interaction Journalizing collects contact events via all channels【385087597506863†L30-L32】; Business Partner Interaction Management manages all contact events with business partners【352688260423662†L32-L34】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Communication & collaboration tools",
                        "definition": "Facilitates two‑way communication, notifications, and collaboration with partners, including sharing of announcements, marketing campaigns and co‑branding materials.",
                        "tm_forum_mapping": "ZINFI describes partner portal management as enabling real‑time updates, automated notifications and communication tools【745588469347582†L392-L431】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Training & certification delivery",
                        "definition": "Provides structured training modules and certification programs for partners, tracks completion and ensures up‑to‑date knowledge of products and services.",
                        "tm_forum_mapping": "ZINFI notes that partner portals automate training and certification, guiding partners through learning paths and issuing certifications upon completion【745588469347582†L408-L415】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Marketing & sales collaboration",
                        "definition": "Supports deal registration, lead routing, co‑marketing campaigns and sharing of sales and marketing resources to align partner sales activities.",
                        "tm_forum_mapping": "Salesforce PRM highlights deal registration, lead routing and marketing automation as key partner capabilities【134323199946071†L7-L12】【134323199946071†L26-L41】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Order & Fulfillment Management",
                "description": "Manages the ordering and fulfilment lifecycle for goods or services sourced from partners.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "Purchase requisition & order validation",
                        "definition": "Receives and validates purchase requisitions, manages approvals and converts them into partner orders based on agreed commercial arrangements.",
                        "tm_forum_mapping": "Business Partner Order Validation receives purchase requisition, manages approvals and converts into Business Partner Order【795619638741849†L29-L31】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Order fulfilment & lifecycle tracking",
                        "definition": "Manages orders placed with partners, monitors fulfilment progress, and tracks lifecycle events and order lines.",
                        "tm_forum_mapping": "Business Partner Order Management manages the order to supplier or partner and the control of their fulfilment【967103347254896†L32-L34】; Business Partner Order Repository Management tracks and manages events and lifecycle of orders and their items【282610198797586†L30-L32】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Goods receipt & returns management",
                        "definition": "Records the receipt of goods or services from partners, checks quantity and quality and manages returns where necessary.",
                        "tm_forum_mapping": "Goods Receipt manages suppliers’ goods receipt including checking quantity and working and possible return【564667274016877†L28-L29】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Agreement & Contract Management",
                "description": "Handles the lifecycle of contracts and agreements with partners, including negotiation, execution, compliance and renewal.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Agreement creation & negotiation",
                        "definition": "Creates agreement templates, negotiates terms (pricing, service levels, revenue sharing) and obtains approvals before execution.",
                        "tm_forum_mapping": "Agreement management is supported by TMF651 Agreement Management API and is integral to partner lifecycle management【224588721648699†L29-L40】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Contract execution & renewal",
                        "definition": "Manages the execution of partner contracts, monitors expiry dates and renewals and ensures compliance with contractual obligations.",
                        "tm_forum_mapping": "Vendor solutions (e.g., CSG) include agreement management for complex partner rates, flexible billing and revenue sharing【572897595934402†L243-L286】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Service level & performance terms",
                        "definition": "Defines and tracks service level agreements (SLAs) and performance obligations, ensuring partners meet quality, delivery and compliance targets.",
                        "tm_forum_mapping": "Business Partner Performance Management evaluates partner performance such as supplier performance【846125797427045†L32-L34】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Rating, Billing & Revenue Sharing",
                "description": "Controls rating of partner transactions, bill calculation, revenue sharing and settlement processes.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Rating & discounting",
                        "definition": "Applies pricing models, tariffs, discounts, penalties and incentives to partner transactions using flexible rating engines.",
                        "tm_forum_mapping": "Business Partner Rating manages the rating part of the supplier or partner【141232985639677†L32-L33】; Business Partner Rating and Revenue Sharing identifies relevant pricing rules (tariffs, discounts, penalties) according to revenue sharing agreements【64269887189788†L30-L36】; vendor solutions like Subex support dynamic rating and discounting【250300021536997†L124-L148】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Bill calculation & invoicing",
                        "definition": "Generates bill items for partners, aggregates rating results, applies taxes and calculates penalties or bonuses for invoicing purposes.",
                        "tm_forum_mapping": "Business Partner Bill Calculation collects and aggregates rating results, prepares bill items, handles penalties/bonus and applies complex tax rules【822124640395761†L30-L35】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Revenue sharing identification & enforcement",
                        "definition": "Identifies applicable revenue sharing rules based on agreements and calculates amounts owed to or from partners. Enforces revenue sharing pricing and settlement across recurring, one‑time and usage charges.",
                        "tm_forum_mapping": "Business Partner Rating and Revenue Sharing identifies pricing rules and applies revenue sharing to calculate what the CSP owes to or is owed by the partner for different charge types【64269887189788†L30-L47】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Settlement management",
                        "definition": "Aggregates invoices and calculates settlement balances to minimise two‑way financial flows; issues settlement notes and manages settlement accounts.",
                        "tm_forum_mapping": "Settlement Management aggregates received and produced invoices per partner, uses a settlement account and determines whether payment is sent or requested【297002131371106†L30-L37】.",
                        "importance": "high"
                    }
                ]
            },
            {
                "domain_name": "Partner Invoice & Payment Management",
                "description": "Manages financial interfaces with partners, including invoices, payments, accounts and reconciliations.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Invoice management & matching",
                        "definition": "Generates and processes partner invoices, matches incoming supplier invoices with expected charges and manages invoice disputes and adjustments.",
                        "tm_forum_mapping": "Business Partner Invoice Management manages the financial interface with suppliers or partners, including invoice matching and settlement【51328919582743†L33-L35】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Payment processing",
                        "definition": "Handles inbound and outbound payments, assigns payments to invoices and settlement accounts and ensures timely payables and receivables.",
                        "tm_forum_mapping": "Business Partner Payment Management implements payment according to due debt and assigns inbound/outbound payments to invoices and settlement【92747088712684†L30-L33】; Partner Payments Management handles payments and tracks full or partial payments【423260218301212†L29-L30】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Account & ledger management",
                        "definition": "Maintains partner accounts, balances and ledgers, supports multi‑currency operations and integrates with ERP and taxation systems.",
                        "tm_forum_mapping": "Business Partner Financial Management groups functions used to pay business partners【731193532997699†L32-L33】; vendor solutions such as CSG provide multi‑currency and tax rule support【877572897611138†L80-L146】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Reconciliation & assurance",
                        "definition": "Performs reconciliation of invoices and payments, identifies discrepancies, manages credit and debit notes and ensures financial accuracy.",
                        "tm_forum_mapping": "Settlement Management uses settlement accounts and sends settlement notes and invoice notes to partners【297002131371106†L30-L37】; Subex Partner Assurance provides invoice reconciliation to reduce disputes【250300021536997†L124-L148】.",
                        "importance": "high"
                    }
                ]
            },
            {
                "domain_name": "Partner Assurance & Dispute Management",
                "description": "Ensures service quality and resolves issues and disputes with partners, including trouble tickets and fraud detection.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "Trouble ticket & dispute management",
                        "definition": "Logs, tracks and resolves partner trouble tickets, including billing and settlement disputes and operational issues.",
                        "tm_forum_mapping": "Business Partner Trouble Ticket Management manages trouble tickets and includes billing and settlement disputes【655889563224078†L31-L33】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Fraud detection & risk assurance",
                        "definition": "Monitors partner transactions and usage data to detect anomalies, potential fraud and revenue leakage, triggering corrective actions.",
                        "tm_forum_mapping": "Vendor platforms such as 6D Technologies provide robust reporting and analytics to detect revenue leakage and fraud【145293886454614†L167-L247】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Compliance & audit management",
                        "definition": "Ensures partners comply with legal, regulatory and internal policies through audits and continuous monitoring.",
                        "tm_forum_mapping": "Business Partner Performance Evaluation includes evaluation of ethics and environmental criteria【667091016437991†L31-L38】.",
                        "importance": "high"
                    }
                ]
            },
            {
                "domain_name": "Partner Performance & Analytics",
                "description": "Evaluates and reports on partner performance, quality, financial health and other key metrics to support decision‑making and continuous improvement.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Performance evaluation & scoring",
                        "definition": "Assesses partner quality, cost competitiveness, delivery performance, technological capability and adherence to SLAs; calculates performance scores.",
                        "tm_forum_mapping": "Business Partner Performance Evaluation reduces purchase risk and evaluates quality, cost, delivery, technological capability, financial risk, previous performance, ethics and environment【667091016437991†L31-L38】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Financial risk analysis & scoring",
                        "definition": "Assesses partners’ financial health, credit risk and potential financial exposure; assigns risk scores.",
                        "tm_forum_mapping": "Business Partner Financial Analysis identifies potential financial risks associated with partners and calculates a risk score【338184556346341†L30-L32】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Analytics & reporting",
                        "definition": "Provides dashboards, KPIs and analytics across partner activities (sales, usage, billing, training) with drill‑down and real‑time capabilities.",
                        "tm_forum_mapping": "ZINFI’s portal management highlights real‑time performance monitoring and analytics within partner portals【745588469347582†L416-L423】; Subex offers 360° partner visibility via reports and alerts【250300021536997†L23-L74】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Partner scoring & segmentation",
                        "definition": "Classifies partners into tiers or segments based on performance, revenue contribution, strategic importance and risk.",
                        "tm_forum_mapping": "Business Partner Performance Management evaluates supplier performance【846125797427045†L32-L34】 and supports segmentation; vendor systems like Subex provide partner scoring and anomaly detection【250300021536997†L124-L148】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Incentives & Compensation",
                "description": "Defines and manages commission structures, rebates, rewards and marketing funds to incentivize partner performance.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "Commission & residual management",
                        "definition": "Configures multi‑level commission structures, residuals and chargebacks based on services, devices or other criteria; supports SPIFs (sales performance incentive funds).",
                        "tm_forum_mapping": "TimelyBill provides multi‑level partner hierarchies and allows creation of multi‑tiered commission and residual structures【584394698289916†L45-L76】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Rebates & bonus programs",
                        "definition": "Manages rebate programs tied to performance milestones or volume commitments, calculating payouts and handling claw‑backs.",
                        "tm_forum_mapping": "Vendor platforms offer promotional pricing, volume discounts and minimum revenue guarantees as part of revenue share models【572897595934402†L243-L286】.",
                        "importance": "low"
                    },
                    {
                        "attribute_name": "Marketing development funds (MDF)",
                        "definition": "Manages partner funding requests for marketing activities, including budgeting, approval, tracking and reconciliation.",
                        "tm_forum_mapping": "Salesforce PRM includes marketing fund management to automate fund requests and approvals【134323199946071†L48-L95】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Governance & Compliance",
                "description": "Ensures that partner operations adhere to legal, regulatory and policy requirements, including privacy, security and ethical standards.",
                "importance": "high",
                "attributes": [
                    {
                        "attribute_name": "Data privacy & security",
                        "definition": "Applies role‑based access controls, ensures secure capture and delivery of information and complies with data protection regulations (e.g., GDPR, CCPA).",
                        "tm_forum_mapping": "Business Partner Portal Access ensures role‑based security and safe and secure capture/delivery of information【118499276135085†L28-L33】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Regulatory compliance & certification",
                        "definition": "Ensures compliance with telecom regulations, tax laws, international trade rules and industry standards; manages necessary certifications and audits.",
                        "tm_forum_mapping": "Partner Financial Risk Management emphasises collecting financial risk information from third parties for internal use【936866992268158†L28-L35】; Business Partner Performance Evaluation includes evaluation criteria on ethics and environmental considerations【667091016437991†L31-L38】.",
                        "importance": "high"
                    },
                    {
                        "attribute_name": "Audit & risk management",
                        "definition": "Monitors partner processes and transactions, performs audits, assesses operational risks and defines mitigation plans.",
                        "tm_forum_mapping": "Business Partner Strategy Analysis manages analysis such as risk analysis【920645339809991†L31-L32】; vendor platforms provide analytics for risk and anomaly detection【250300021536997†L23-L74】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Data Integration & Ecosystem Management",
                "description": "Integrates partner management with enterprise systems and supports multi‑tenant, multi‑currency operations in a global partner ecosystem.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "API & integration management",
                        "definition": "Provides standardized open APIs to integrate partner data with BSS/OSS, CRM, ERP and external platforms; supports TMF APIs like TMF668 (Partnership Management), TMF651 (Agreement Management), TMF632 (Party Management) and TMF738 (Revenue Sharing Model).",
                        "tm_forum_mapping": "Radio Qubits’ Partner Management toolbox includes Partnership Management API (TMF668), Agreement Management API (TMF651), Party Management API (TMF632) and Revenue Sharing Model Management (TMF738) for partner lifecycle management【224588721648699†L29-L40】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Multi‑tenant & multi‑currency support",
                        "definition": "Supports operations across multiple business units, partners and geographies with multi‑currency, multi‑language and multi‑tax capabilities.",
                        "tm_forum_mapping": "Comarch’s partner management system supports multi‑currency operations and multi‑tenancy, ensuring global operations【877572897611138†L80-L146】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Data synchronization & quality",
                        "definition": "Synchronizes partner data across systems, ensures data consistency, quality and completeness and enables unified partner views.",
                        "tm_forum_mapping": "Partner Information Management ensures delivery of a consistent, accurate and complete partner view across the enterprise【320233063939816†L32-L35】.",
                        "importance": "medium"
                    }
                ]
            },
            {
                "domain_name": "Partner Hierarchy & Relationship Management",
                "description": "Manages partner roles, relationships and hierarchies within the ecosystem, including linking partner accounts to customers.",
                "importance": "medium",
                "attributes": [
                    {
                        "attribute_name": "Role & relationship management",
                        "definition": "Defines partner roles (reseller, distributor, wholesaler, MVNO, content provider, etc.), manages relationships between partners and the service provider and supports various partner types.",
                        "tm_forum_mapping": "6D Technologies’ PRM supports unified management for different partner types including interconnect, roaming, VAS, MVNO/MVNE, content and wholesale【145293886454614†L167-L247】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Hierarchy & territory assignment",
                        "definition": "Establishes multi‑tiered partner hierarchies, assigns territories or regions and manages parent‑child relationships.",
                        "tm_forum_mapping": "Partner Hierarchy & Group Management provides necessary functionality to manage partner hierarchy and groups【851013082392119†L28-L30】; TimelyBill supports multi‑level partner hierarchies and custom regions/districts【584394698289916†L45-L76】.",
                        "importance": "medium"
                    },
                    {
                        "attribute_name": "Account linking & cross‑entity relationships",
                        "definition": "Links partner accounts to customer accounts, parent or organization accounts to facilitate cross‑entity billing and relationship management.",
                        "tm_forum_mapping": "TimelyBill allows linking partner accounts to customer accounts and paying at partner/parent/organization level【584394698289916†L45-L76】.",
                        "importance": "low"
                    }
                ]
            }
        ]
    }
}
